MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC1517JBD64/mcu.h

/****************************************************************************************************//**
 * @file     LPC15xx.h
 *
 * @brief    CMSIS Cortex-M3 Peripheral Access Layer Header File for
 *           LPC15xx from .
 *
 * @version  V0.3
 * @date     17. July 2013
 *
 * @note     Generated with SVDConv V2.80 
 *           from CMSIS SVD File 'H2_v0.3.svd' Version 0.3,
 *
 *                                                                                      modified by Keil
 *******************************************************************************************************/



/** @addtogroup (null)
  * @{
  */

/** @addtogroup LPC15xx
  * @{
  */

#ifndef LPC15XX_H
#define LPC15XX_H

#ifdef __cplusplus
extern "C" {
#endif


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* -------------------  Cortex-M3 Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NonMaskableInt_IRQn           = -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */
  MemoryManagement_IRQn         = -12,              /*!<   4  Memory Management, MPU mismatch, including Access Violation
                                                              and No Match                                                     */
  BusFault_IRQn                 = -11,              /*!<   5  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                              related Fault                                                    */
  UsageFault_IRQn               = -10,              /*!<   6  Usage Fault, i.e. Undef Instruction, Illegal State Transition    */
  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */
  DebugMonitor_IRQn             =  -4,              /*!<  12  Debug Monitor                                                    */
  PendSV_IRQn                   =  -2,              /*!<  14  Pendable request for system service                              */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* ---------------------  LPC15xx Specific Interrupt Numbers  --------------------- */
  WDT_IRQn                      =   0,              /*!<   0  WDT                                                              */
  BOD_IRQn                      =   1,              /*!<   1  BOD                                                          */
  FLASH_IRQn                    =   2,              /*!<   2  FLASH                                                            */
  EE_IRQn                       =   3,              /*!<   3  EE                                                               */
  DMA_IRQn                      =   4,              /*!<   4  DMA                                                              */
  GINT0_IRQn                    =   5,              /*!<   5  GINT0                                                            */
  GINT1_IRQn                    =   6,              /*!<   6  GINT1                                                            */
  PIN_INT0_IRQn                 =   7,              /*!<   7  PIN_INT0                                                         */
  PIN_INT1_IRQn                 =   8,              /*!<   8  PIN_INT1                                                         */
  PIN_INT2_IRQn                 =   9,              /*!<   9  PIN_INT2                                                         */
  PIN_INT3_IRQn                 =  10,              /*!<  10  PIN_INT3                                                         */
  PIN_INT4_IRQn                 =  11,              /*!<  11  PIN_INT4                                                         */
  PIN_INT5_IRQn                 =  12,              /*!<  12  PIN_INT5                                                         */
  PIN_INT6_IRQn                 =  13,              /*!<  13  PIN_INT6                                                         */
  PIN_INT7_IRQn                 =  14,              /*!<  14  PIN_INT7                                                         */
  RIT_IRQn                      =  15,              /*!<  15  RIT                                                              */
  SCT0_IRQn                     =  16,              /*!<  16  SCT0                                                             */
  SCT1_IRQn                     =  17,              /*!<  17  SCT1                                                             */
  SCT2_IRQn                     =  18,              /*!<  18  SCT2                                                             */
  SCT3_IRQn                     =  19,              /*!<  19  SCT3                                                             */
  MRT_IRQn                      =  20,              /*!<  20  MRT                                                              */
  UART0_IRQn                    =  21,              /*!<  21  UART0                                                            */
  UART1_IRQn                    =  22,              /*!<  22  UART1                                                            */
  UART2_IRQn                    =  23,              /*!<  23  UART2                                                            */
  I2C0_IRQn                     =  24,              /*!<  24  I2C0                                                             */
  SPI0_IRQn                     =  25,              /*!<  25  SPI0                                                             */
  SPI1_IRQn                     =  26,              /*!<  26  SPI1                                                             */
  C_CAN0_IRQn                   =  27,              /*!<  27  C_CAN0                                                           */
  USB_IRQ_IRQn                  =  28,              /*!<  28  USB_IRQ                                                          */
  USB_FIQ_IRQn                  =  29,              /*!<  29  USB_FIQ                                                          */
  USBWAKEUP_IRQn                =  30,              /*!<  30  USBWAKEUP                                                        */
  ADC0_SEQA_IRQn                =  31,              /*!<  31  ADC0_SEQA                                                        */
  ADC0_SEQB_IRQn                =  32,              /*!<  32  ADC0_SEQB                                                        */
  ADC0_THCMP_IRQn               =  33,              /*!<  33  ADC0_THCMP                                                       */
  ADC0_OVR_IRQn                 =  34,              /*!<  34  ADC0_OVR                                                         */
  ADC1_SEQA_IRQn                =  35,              /*!<  35  ADC1_SEQA                                                        */
  ADC1_SEQB_IRQn                =  36,              /*!<  36  ADC1_SEQB                                                        */
  ADC1_THCMP_IRQn               =  37,              /*!<  37  ADC1_THCMP                                                       */
  ADC1_OVR_IRQn                 =  38,              /*!<  38  ADC1_OVR                                                         */
  DAC_IRQn                      =  39,              /*!<  39  DAC                                                              */
  CMP0_IRQn                     =  40,              /*!<  40  CMP0                                                             */
  CMP1_IRQn                     =  41,              /*!<  41  CMP1                                                             */
  CMP2_IRQn                     =  42,              /*!<  42  CMP2                                                             */
  CMP3_IRQn                     =  43,              /*!<  43  CMP3                                                             */
  QEI_IRQn                      =  44,              /*!<  44  QEI                                                              */
  RTC_ALARM_IRQn                =  45,              /*!<  45  RTC_ALARM                                                        */
  RTC_WAKE_IRQn                 =  46               /*!<  46  RTC_WAKE                                                         */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the Cortex-M3 Processor and Core Peripherals---------------- */
#define __CM3_REV                 0x0201            /*!< Cortex-M3 Core Revision                                               */
#define __MPU_PRESENT                  0            /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS               3            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm3.h"                               /*!< Cortex-M3 processor and core peripherals                              */
// Note: Changed for MikroE implementation.
//#include "system_LPC15xx.h"                         /*!< LPC15xx System                                                        */
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif



/* ================================================================================ */
/* ================                    GPIO_PORT                   ================ */
/* ================================================================================ */


/**
  * @brief General Purpose I/O (GPIO)  (GPIO_PORT)
  */

typedef struct {                                    /*!< GPIO_PORT Structure                                                   */
  __IO uint8_t   B[76];                             /*!< Byte pin registers                                                    */
  __I  uint32_t  RESERVED0[45];
  __IO uint32_t  W[76];                             /*!< Word pin registers                                                    */
  __I  uint32_t  RESERVED1[1908];
  __IO uint32_t  DIR[3];                            /*!< Port Direction registers                                              */
  __I  uint32_t  RESERVED2[29];
  __IO uint32_t  MASK[3];                           /*!< Port Mask register                                                    */
  __I  uint32_t  RESERVED3[29];
  __IO uint32_t  PIN[3];                            /*!< Port pin register                                                     */
  __I  uint32_t  RESERVED4[29];
  __IO uint32_t  MPIN[3];                           /*!< Masked port register                                                  */
  __I  uint32_t  RESERVED5[29];
  __IO uint32_t  SET[3];                            /*!< Write: Set port register Read: port output bits                       */
  __I  uint32_t  RESERVED6[29];
  __O  uint32_t  CLR[3];                            /*!< Clear port                                                            */
  __I  uint32_t  RESERVED7[29];
  __O  uint32_t  NOT[3];                            /*!< Toggle port                                                           */
} LPC_GPIO_PORT_Type;


/* ================================================================================ */
/* ================                       DMA                      ================ */
/* ================================================================================ */


/**
  * @brief DMA controller (DMA)
  */

