MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC1517JBD64/mcu.h
typedef struct {                                    /*!< SWM Structure                                                         */
  __IO uint32_t  PINASSIGN0;                        /*!< Pin assign register 0. Assign movable functions U0_TXD, U0_RXD,
                                                         U0_RTS, U0_CTS.                                                       */
  __IO uint32_t  PINASSIGN1;                        /*!< Pin assign register 1. Assign movable functions U0_SCLK, U1_TXD,
                                                         U1_RXD, U1_RTS.                                                       */
  __IO uint32_t  PINASSIGN2;                        /*!< Pin assign register 2. Assign movable functions U1_CTS, U1_SCLK,
                                                         U2_TXD, U2_RXD.                                                       */
  __IO uint32_t  PINASSIGN3;                        /*!< Pin assign register 3. Assign movable function .                      */
  __IO uint32_t  PINASSIGN4;                        /*!< Pin assign register 4. Assign movable functions                       */
  __IO uint32_t  PINASSIGN5;                        /*!< Pin assign register 5. Assign movable functions                       */
  __IO uint32_t  PINASSIGN6;                        /*!< Pin assign register 6. Assign movable functions                       */
  __IO uint32_t  PINASSIGN7;                        /*!< Pin assign register 7. Assign movable functions                       */
  __IO uint32_t  PINASSIGN8;                        /*!< Pin assign register 8. Assign movable functions                       */
  __IO uint32_t  PINASSIGN9;                        /*!< Pin assign register 9. Assign movable functions                       */
  __IO uint32_t  PINASSIGN10;                       /*!< Pin assign register 10. Assign movable functions                      */
  __IO uint32_t  PINASSIGN11;                       /*!< Pin assign register 11. Assign movable functions                      */
  __IO uint32_t  PINASSIGN12;                       /*!< Pin assign register 12. Assign movable functions                      */
  __IO uint32_t  PINASSIGN13;                       /*!< Pin assign register 13. Assign movable functions                      */
  __IO uint32_t  PINASSIGN14;                       /*!< Pin assign register 14. Assign movable functions                      */
  __IO uint32_t  PINASSIGN15;                       /*!< Pin assign register 15. Assign movable functions                      */
  __I  uint32_t  RESERVED0[96];
  __IO uint32_t  PINENABLE0;                        /*!< Pin enable register 0. Enables fixed-pin functions                    */
  __IO uint32_t  PINENABLE1;                        /*!< Pin enable register 0. Enables fixed-pin functions                    */
} LPC_SWM_Type;


/* ================================================================================ */
/* ================                       PMU                      ================ */
/* ================================================================================ */


/**
  * @brief Power Management Unit (PMU) (PMU)
  */

typedef struct {                                    /*!< PMU Structure                                                         */
  __IO uint32_t  PCON;                              /*!< Power control register                                                */
  __IO uint32_t  GPREG0;                            /*!< General purpose register 0                                            */
  __IO uint32_t  GPREG1;                            /*!< General purpose register 0                                            */
  __IO uint32_t  GPREG2;                            /*!< General purpose register 0                                            */
  __IO uint32_t  GPREG3;                            /*!< General purpose register 0                                            */
  __IO uint32_t  DPDCTRL;                           /*!< Deep power-down control register                                      */
} LPC_PMU_Type;


/* ================================================================================ */
/* ================                     USART0                     ================ */
/* ================================================================================ */


/**
  * @brief USART0  (USART0)
  */

typedef struct {                                    /*!< USART0 Structure                                                      */
  __IO uint32_t  CFG;                               /*!< USART Configuration register. Basic USART configuration settings
                                                         that typically are not changed during operation.                      */
  __IO uint32_t  CTRL;                              /*!< USART Control register. USART control settings that are more
                                                         likely to change during operation.                                    */
  __IO uint32_t  STAT;                              /*!< USART Status register. The complete status value can be read
                                                         here. Writing ones clears some bits in the register. Some bits
                                                          can be cleared by writing a 1 to them.                               */
  __IO uint32_t  INTENSET;                          /*!< Interrupt Enable read and Set register. Contains an individual
                                                         interrupt enable bit for each potential USART interrupt. A complete
                                                          value may be read from this register. Writing a 1 to any implemented
                                                          bit position causes that bit to be set.                              */
  __O  uint32_t  INTENCLR;                          /*!< Interrupt Enable Clear register. Allows clearing any combination
                                                         of bits in the INTENSET register. Writing a 1 to any implemented
                                                          bit position causes the corresponding bit to be cleared.             */
  __I  uint32_t  RXDATA;                            /*!< Receiver Data register. Contains the last character received.         */
  __I  uint32_t  RXDATASTAT;                        /*!< Receiver Data with Status register. Combines the last character
                                                         received with the current USART receive status. Allows DMA or
                                                          software to recover incoming data and status together.               */
  __IO uint32_t  TXDATA;                            /*!< Transmit Data register. Data to be transmitted is written here.       */
  __IO uint32_t  BRG;                               /*!< Baud Rate Generator register. 16-bit integer baud rate divisor
                                                         value.                                                                */
  __I  uint32_t  INTSTAT;                           /*!< Interrupt status register. Reflects interrupts that are currently
                                                         enabled.                                                              */
} LPC_USART0_Type;


/* ================================================================================ */
/* ================                      SPI0                      ================ */
/* ================================================================================ */


/**
  * @brief SPI0  (SPI0)
  */

typedef struct {                                    /*!< SPI0 Structure                                                        */
  __IO uint32_t  CFG;                               /*!< SPI Configuration register                                            */
  __IO uint32_t  DLY;                               /*!< SPI Delay register                                                    */
  __IO uint32_t  STAT;                              /*!< SPI Status. Some status flags can be cleared by writing a 1
                                                         to that bit position                                                  */
  __IO uint32_t  INTENSET;                          /*!< SPI Interrupt Enable read and Set. A complete value may be read
                                                         from this register. Writing a 1 to any implemented bit position
                                                          causes that bit to be set.                                           */
  __O  uint32_t  INTENCLR;                          /*!< SPI Interrupt Enable Clear. Writing a 1 to any implemented bit
                                                         position causes the corresponding bit in INTENSET to be cleared.      */
  __I  uint32_t  RXDAT;                             /*!< SPI Receive Data                                                      */
  __IO uint32_t  TXDATCTL;                          /*!< SPI Transmit Data with Control                                        */
  __IO uint32_t  TXDAT;                             /*!< SPI Transmit Data with Control                                        */
  __IO uint32_t  TXCTL;                             /*!< SPI Transmit Control                                                  */
  __IO uint32_t  DIV;                               /*!< SPI clock Divider                                                     */
  __I  uint32_t  INTSTAT;                           /*!< SPI Interrupt Status                                                  */
} LPC_SPI0_Type;


/* ================================================================================ */
/* ================                      I2C0                      ================ */
/* ================================================================================ */


/**
  * @brief I2C-bus interface  (I2C0)
  */

typedef struct {                                    /*!< I2C0 Structure                                                        */
  __IO uint32_t  CFG;                               /*!< Configuration for shared functions.                                   */
  __IO uint32_t  STAT;                              /*!< Status register for Master, Slave, and Monitor functions.             */
  __IO uint32_t  INTENSET;                          /*!< Interrupt Enable Set and read register.                               */
  __O  uint32_t  INTENCLR;                          /*!< Interrupt Enable Clear register.                                      */
  __IO uint32_t  TIMEOUT;                           /*!< Time-out value register.                                              */
  __IO uint32_t  DIV;                               /*!< Clock pre-divider for the entire I2C block. This determines
                                                         what time increments are used for the MSTTIME and SLVTIME registers.  */
  __I  uint32_t  INTSTAT;                           /*!< Interrupt Status register for Master, Slave, and Monitor functions.   */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  MSTCTL;                            /*!< Master control register.                                              */
  __IO uint32_t  MSTTIME;                           /*!< Master timing configuration.                                          */
  __IO uint32_t  MSTDAT;                            /*!< Combined Master receiver and transmitter data register.               */
  __I  uint32_t  RESERVED1[5];
  __IO uint32_t  SLVCTL;                            /*!< Slave control register.                                               */
  __IO uint32_t  SLVDAT;                            /*!< Combined Slave receiver and transmitter data register.                */
  __IO uint32_t  SLVADR0;                           /*!< Slave address 0.                                                      */
  __IO uint32_t  SLVADR1;                           /*!< Slave address 0.                                                      */
  __IO uint32_t  SLVADR2;                           /*!< Slave address 0.                                                      */
  __IO uint32_t  SLVADR3;                           /*!< Slave address 0.                                                      */
  __IO uint32_t  SLVQUAL0;                          /*!< Slave Qualification for address 0.                                    */
  __I  uint32_t  RESERVED2[9];
  __I  uint32_t  MONRXDAT;                          /*!< Monitor receiver data register.                                       */
} LPC_I2C0_Type;


/* ================================================================================ */
/* ================                       QEI                      ================ */
/* ================================================================================ */


/**
  * @brief Quadrature Encoder Interface (QEI)  (QEI)
  */

typedef struct {                                    /*!< QEI Structure                                                         */
  __O  uint32_t  CON;                               /*!< Control register                                                      */
  __I  uint32_t  STAT;                              /*!< Encoder status register                                               */
  __IO uint32_t  CONF;                              /*!< Configuration register                                                */
  __I  uint32_t  POS;                               /*!< Position register                                                     */
  __IO uint32_t  MAXPOS;                            /*!< Maximum position register                                             */
  __IO uint32_t  CMPOS0;                            /*!< position compare register 0                                           */
  __IO uint32_t  CMPOS1;                            /*!< position compare register 1                                           */
  __IO uint32_t  CMPOS2;                            /*!< position compare register 2                                           */
  __I  uint32_t  INXCNT;                            /*!< Index count register                                                  */
  __IO uint32_t  INXCMP0;                           /*!< Index compare register 0                                              */
  __IO uint32_t  LOAD;                              /*!< Velocity timer reload register                                        */
  __I  uint32_t  TIME;                              /*!< Velocity timer register                                               */
  __I  uint32_t  VEL;                               /*!< Velocity counter register                                             */
  __I  uint32_t  CAP;                               /*!< Velocity capture register                                             */
  __IO uint32_t  VELCOMP;                           /*!< Velocity compare register                                             */
  __IO uint32_t  FILTERPHA;                         /*!< Digital filter register on input phase A (QEI_A)                      */
  __IO uint32_t  FILTERPHB;                         /*!< Digital filter register on input phase B (QEI_B)                      */
  __IO uint32_t  FILTERINX;                         /*!< Digital filter register on input index (QEI_IDX)                      */
  __IO uint32_t  WINDOW;                            /*!< Index acceptance window register                                      */
  __IO uint32_t  INXCMP1;                           /*!< Index compare register 1                                              */
  __IO uint32_t  INXCMP2;                           /*!< Index compare register 2                                              */
  __I  uint32_t  RESERVED0[993];
  __O  uint32_t  IEC;                               /*!< Interrupt enable clear register                                       */
  __O  uint32_t  IES;                               /*!< Interrupt enable set register                                         */
  __I  uint32_t  INTSTAT;                           /*!< Interrupt status register                                             */
  __O  uint32_t  IE;                                /*!< Interrupt enable clear register                                       */
  __O  uint32_t  CLR;                               /*!< Interrupt status clear register                                       */
  __O  uint32_t  SET;                               /*!< Interrupt status set register                                         */
} LPC_QEI_Type;


/* ================================================================================ */
/* ================                     SYSCON                     ================ */
/* ================================================================================ */


/**
  * @brief System configuration (SYSCON) (SYSCON)
  */
                                                    /* updated LPC_SYSCON_Type Keil 26.08.2015 */
typedef struct {                                    /*!< SYSCON Structure */
  __IO uint32_t  SYSMEMREMAP;                       /*!< (R/W)  0x000  System memory remap */
  __I  uint32_t  RESERVED0[2];          
  __IO uint32_t  AHBBUFEN0;                         /*!< (R/W)  0x00C  AHB-to-APB bridge 0 write buffering control */
  __IO uint32_t  AHBBUFEN1;                         /*!< (R/W)  0x010  AHB-to-APB bridge 1 write buffering control */
  __IO uint32_t  SYSTCKCAL;                         /*!< (R/W)  0x014  System tick counter calibration */
  __I  uint32_t  RESERVED1;                         /*!< (R/W)  0x018  Reserved */
  __IO uint32_t  NMISRC;                            /*!< (R/W)  0x01C  NMI Source Control */
  __I  uint32_t  RESERVED2[8];          
  __IO uint32_t  SYSRSTSTAT;                        /*!< (R/W)  0x040  System reset status register */
  __IO uint32_t  PRESETCTRL0;                       /*!< (R/W)  0x044  Peripheral reset control 0 */
  __IO uint32_t  PRESETCTRL1;                       /*!< (R/W)  0x048  Peripheral reset control 1 */
  __I  uint32_t  PIOPORCAP0;                        /*!< (R  )  0x04C  POR captured PIO status 0 */
  __I  uint32_t  PIOPORCAP1;                        /*!< (R  )  0x050  POR captured PIO status 1 */
  __I  uint32_t  PIOPORCAP2;                        /*!< (R  )  0x054  POR captured PIO status 2 */
  __I  uint32_t  RESERVED3[10];         
  __IO uint32_t  MAINCLKSELA;                       /*!< (R/W)  0x080  Main clock source select A */
  __IO uint32_t  MAINCLKSELB;                       /*!< (R/W)  0x084  Main clock source select B */
  __IO uint32_t  USBCLKSEL;                         /*!< (R/W)  0x088  USB clock source select */
  __IO uint32_t  ADCASYNCCLKSEL;                    /*!< (R/W)  0x08C  ADC asynchronous clock source select */
  __I  uint32_t  RESERVED4;             
  __IO uint32_t  CLKOUTSELA;                        /*!< (R/W)  0x094  CLKOUT clock source select A */
  __IO uint32_t  CLKOUTSELB;                        /*!< (R/W)  0x098  CLKOUT clock source select B */
  __I  uint32_t  RESERVED5;             
  __IO uint32_t  SYSPLLCLKSEL;                      /*!< (R/W)  0x0A0  System PLL clock source select */
  __IO uint32_t  USBPLLCLKSEL;                      /*!< (R/W)  0x0A4  USB PLL clock source select */
  __IO uint32_t  SCTPLLCLKSEL;                      /*!< (R/W)  0x0A8  SCT PLL clock source select */
  __I  uint32_t  RESERVED6[5];          
  __IO uint32_t  SYSAHBCLKDIV;                      /*!< (R/W)  0x0C0  System clock divider */
  __IO uint32_t  SYSAHBCLKCTRL0;                    /*!< (R/W)  0x0C4  System clock control */
  __IO uint32_t  SYSAHBCLKCTRL1;                    /*!< (R/W)  0x0C8  System clock control */
  __IO uint32_t  SYSTICKCLKDIV;                     /*!< (R/W)  0x0CC  SYSTICK clock divider */
  __IO uint32_t  UARTCLKDIV;                        /*!< (R/W)  0x0D0  USART clock divider. Clock divider for the USART fractional baud rate generator */
  __IO uint32_t  IOCONCLKDIV;                       /*!< (R/W)  0x0D4  Peripheral clock to the IOCON block for programmable glitch filter */
  __IO uint32_t  TRACECLKDIV;                       /*!< (R/W)  0x0D8  ARM trace clock divider */
  __I  uint32_t  RESERVED7[4];          
  __IO uint32_t  USBCLKDIV;                         /*!< (R/W)  0x0EC  USB clock divider */
  __IO uint32_t  ADCASYNCCLKDIV;                    /*!< (R/W)  0x0F0  Asynchronous ADC clock divider */
  __I  uint32_t  RESERVED8;             
  __IO uint32_t  CLKOUTDIV;                         /*!< (R/W)  0x0F8  CLKOUT clock divider */
  __I  uint32_t  RESERVED9[9];          
  __IO uint32_t  FREQMECTRL;                        /*!< (R/W)  0x120  Frequency measure register */
  __IO uint32_t  FLASHCFG;                          /*!< (R/W)  0x124  Flash waitstates configuration register */
  __IO uint32_t  FRGCTRL;                           /*!< (R/W)  0x128  USART fractional baud rate generator control */
  __IO uint32_t  USBCLKCTRL;                        /*!< (R/W)  0x12C  USB clock control */
  __IO uint32_t  USBCLKST;                          /*!< (R/W)  0x130  USB clock status */
  __I  uint32_t  RESERVED10[19];        
  __IO uint32_t  BODCTRL;                           /*!< (R/W)  0x180  Brown-Out Detect */
  __IO uint32_t  IRCCTRL;                           /*!< (R/W)  0x184  IRC trim value */
  __IO uint32_t  SYSOSCCTRL;                        /*!< (R/W)  0x188  System oscillator control */
  __I  uint32_t  RESERVED12;            
  __IO uint32_t  RTCOSCCTRL;                        /*!< (R/W)  0x190  RTC oscillator 32 kHz output control */
  __I  uint32_t  RESERVED13;            
  __IO uint32_t  SYSPLLCTRL;                        /*!< (R/W)  0x198  System PLL control */
  __I  uint32_t  SYSPLLSTAT;                        /*!< (R  )  0x19C  System PLL status */
  __IO uint32_t  USBPLLCTRL;                        /*!< (R/W)  0x1A0  USB PLL control */
  __I  uint32_t  USBPLLSTAT;                        /*!< (R  )  0x1A4  USB PLL status */
  __IO uint32_t  SCTPLLCTRL;                        /*!< (R/W)  0x1A8  SCT PLL control */
  __I  uint32_t  SCTPLLSTAT;                        /*!< (R  )  0x1AC  SCT PLL status */
  __I  uint32_t  RESERVED14[21];        
  __IO uint32_t  PDAWAKECFG;                        /*!< (R/W)  0x204  Power-down states for wake-up from deep-sleep */
  __IO uint32_t  PDRUNCFG;                          /*!< (R/W)  0x208  Power configuration register */ 
  __I  uint32_t  RESERVED15[3];         
  __IO uint32_t  STARTERP0;                         /*!< (R/W)  0x218  Start logic 0 wake-up enable register */
  __IO uint32_t  STARTERP1;                         /*!< (R/W)  0x21C  Start logic 1 wake-up enable register */
  __I  uint32_t  RESERVED16[117];       
  __I  uint32_t  JTAG_IDCODE;                       /*!< (R  )  0x3F4  JTAG ID code register */
  __I  uint32_t  DEVICE_ID0;                        /*!< (R  )  0x3F8  Part ID register */
  __I  uint32_t  DEVICE_ID1;                        /*!< (R  )  0x3FC  Boot ROM and die revision register */
} LPC_SYSCON_Type;

