MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC1517JBD64/mcu.h
#define LPC_GPIO_PORT_BASE              0x1C000000UL
#define LPC_DMA_BASE                    0x1C004000UL
#define LPC_USB_BASE                    0x1C00C000UL
#define LPC_CRC_BASE                    0x1C010000UL
#define LPC_SCT0_BASE                   0x1C018000UL
#define LPC_SCT1_BASE                   0x1C01C000UL
#define LPC_SCT2_BASE                   0x1C020000UL
#define LPC_SCT3_BASE                   0x1C024000UL
#define LPC_ADC0_BASE                   0x40000000UL
#define LPC_DAC_BASE                    0x40004000UL
#define LPC_ACMP_BASE                   0x40008000UL
#define LPC_INMUX_BASE                  0x40014000UL
#define LPC_RTC_BASE                    0x40028000UL
#define LPC_WWDT_BASE                   0x4002C000UL
#define LPC_SWM_BASE                    0x40038000UL
#define LPC_PMU_BASE                    0x4003C000UL
#define LPC_USART0_BASE                 0x40040000UL
#define LPC_USART1_BASE                 0x40044000UL
#define LPC_SPI0_BASE                   0x40048000UL
#define LPC_SPI1_BASE                   0x4004C000UL
#define LPC_I2C0_BASE                   0x40050000UL
#define LPC_QEI_BASE                    0x40058000UL
#define LPC_SYSCON_BASE                 0x40074000UL
#define LPC_ADC1_BASE                   0x40080000UL
#define LPC_MRT_BASE                    0x400A0000UL
#define LPC_PINT_BASE                   0x400A4000UL
#define LPC_GINT0_BASE                  0x400A8000UL
#define LPC_GINT1_BASE                  0x400AC000UL
#define LPC_RIT_BASE                    0x400B4000UL
#define LPC_SCTIPU_BASE                 0x400B8000UL
#define LPC_FLASHCTRL_BASE              0x400BC000UL
#define LPC_USART2_BASE                 0x400C0000UL
#define LPC_C_CAN0_BASE                 0x400F0000UL
#define LPC_IOCON_BASE                  0x400F8000UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define LPC_GPIO_PORT                   ((LPC_GPIO_PORT_Type      *) LPC_GPIO_PORT_BASE)
#define LPC_DMA                         ((LPC_DMA_Type            *) LPC_DMA_BASE)
#define LPC_USB                         ((LPC_USB_Type            *) LPC_USB_BASE)
#define LPC_CRC                         ((LPC_CRC_Type            *) LPC_CRC_BASE)
#define LPC_SCT0                        ((LPC_SCT0_Type           *) LPC_SCT0_BASE)
#define LPC_SCT1                        ((LPC_SCT0_Type           *) LPC_SCT1_BASE)
#define LPC_SCT2                        ((LPC_SCT2_Type           *) LPC_SCT2_BASE)
#define LPC_SCT3                        ((LPC_SCT2_Type           *) LPC_SCT3_BASE)
#define LPC_ADC0                        ((LPC_ADC0_Type           *) LPC_ADC0_BASE)
#define LPC_DAC                         ((LPC_DAC_Type            *) LPC_DAC_BASE)
#define LPC_ACMP                        ((LPC_ACMP_Type           *) LPC_ACMP_BASE)
#define LPC_INMUX                       ((LPC_INMUX_Type          *) LPC_INMUX_BASE)
#define LPC_RTC                         ((LPC_RTC_Type            *) LPC_RTC_BASE)
#define LPC_WWDT                        ((LPC_WWDT_Type           *) LPC_WWDT_BASE)
#define LPC_SWM                         ((LPC_SWM_Type            *) LPC_SWM_BASE)
#define LPC_PMU                         ((LPC_PMU_Type            *) LPC_PMU_BASE)
#define LPC_USART0                      ((LPC_USART0_Type         *) LPC_USART0_BASE)
#define LPC_USART1                      ((LPC_USART0_Type         *) LPC_USART1_BASE)
#define LPC_SPI0                        ((LPC_SPI0_Type           *) LPC_SPI0_BASE)
#define LPC_SPI1                        ((LPC_SPI0_Type           *) LPC_SPI1_BASE)
#define LPC_I2C0                        ((LPC_I2C0_Type           *) LPC_I2C0_BASE)
#define LPC_QEI                         ((LPC_QEI_Type            *) LPC_QEI_BASE)
#define LPC_SYSCON                      ((LPC_SYSCON_Type         *) LPC_SYSCON_BASE)
#define LPC_ADC1                        ((LPC_ADC0_Type           *) LPC_ADC1_BASE)
#define LPC_MRT                         ((LPC_MRT_Type            *) LPC_MRT_BASE)
#define LPC_PINT                        ((LPC_PINT_Type           *) LPC_PINT_BASE)
#define LPC_GINT0                       ((LPC_GINT0_Type          *) LPC_GINT0_BASE)
#define LPC_GINT1                       ((LPC_GINT0_Type          *) LPC_GINT1_BASE)
#define LPC_RIT                         ((LPC_RIT_Type            *) LPC_RIT_BASE)
#define LPC_SCTIPU                      ((LPC_SCTIPU_Type         *) LPC_SCTIPU_BASE)
#define LPC_FLASHCTRL                   ((LPC_FLASHCTRL_Type      *) LPC_FLASHCTRL_BASE)
#define LPC_USART2                      ((LPC_USART0_Type         *) LPC_USART2_BASE)
#define LPC_C_CAN0                      ((LPC_C_CAN0_Type         *) LPC_C_CAN0_BASE)
#define LPC_IOCON                       ((LPC_IOCON_Type          *) LPC_IOCON_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group LPC15xx */
/** @} */ /* End of group (null) */

#ifdef __cplusplus
}
#endif


#endif  /* LPC15XX_H */

